Revit 2024 API
ExternalEvent.CreateJournalable Method
 Creates an instance of external event which will have the ability to record its executions in the journal.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static ExternalEvent CreateJournalable(
	IExternalEventHandler handler
)
Visual Basic
Public Shared Function CreateJournalable ( _
	handler As IExternalEventHandler _
) As ExternalEvent
Visual C++
public:
static ExternalEvent^ CreateJournalable(
	IExternalEventHandler^ handler
)
Parameters
handler
Type: Autodesk.Revit.UI.IExternalEventHandler
 An instance of IExternalEventHandler which will execute the event.
Return Value
 An instance of ExternalEvent class, which will be used to invoke the event
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ExternalEvent Class
Autodesk.Revit.UI Namespace